print(10 + 10)  # сложение 20
print(100 - 10)  # вычитание 90
print(10 * 10)  # умножение 100
print(77 / 10)  # деление 7.7
print(77 // 10)  # целочисленное деление 7
print(10 ** 2)  # возведение в степень 100
print(7 % 2)  # остаток от деления 1
print(10 ** 2)  # повышение мощности 100
print(10 = 10) # сравнение чисел

# сложные выражения
print(-10)  # -10
print(-(100 + 200))  # -300
print(-(-20))  # 20
print((2 + 2) * 2)  # 8
print(2 + 2 * 2)  # 6
print(10 / 5 / 2)  # 1.0
print(8 / 2 * 5)  # 20.0

# небольшой калькулятор, мы задаем числа в переменные
a = 1234567890
b = 987654321
x = 67890
print((a * b) + x)

# Извлечение квадратного корня из числа эквивалентно возведению этого числа в определенную степень.
# о какой мощности мы говорим? чтобы проиллюстрировать это примером: если корень 25 = 5 и 25 в степени х = 5
# каково значение х? ответ: 0.5 (1/2)


# Напишите программу, которая принимает 3 целых числа a, b и c,
# вычисляет a, умноженное на b, а затем вычитает c из результата.
# Программа должна напечатать результат. a=8 b=11 c=63
a = int(input())
b = int(input())
c = int(input())
print((a * b) - c)
# int целое числа не изменяющая в ходе программы
# float число с плавающей запятой

# программа Факторил из 3
# напишите программу, которая выводит произведение этих трех чисел 1 * 2 * 3.
print(1 * 2 * 3)
