К фактическим ошибкам в коде относятся ошибки из-за которых код может работать неверно.
По сути, это ошибки относящиеся к алгоритму, который используется в программе для решения задачи.

Среди частых фактических ошибок встречаются:
1. отсутствие начальной инициализации переменной;
2. неправильная начальная инициализация переменной;
отсутствие отступа (в Python блоки кода выделяются отступами);
3. неправильные числовые граничные значения, например при использовании функции range();
4. неправильные граничные сравнения (путаница с >, >= или <, <=);
5. путаница логических операций or и and и т.д.