Следует помнить, что наш код должен легко читаться другими программистами.
Чтобы этого достичь, следует придерживаться стандарта PEP 8. Обращайте внимание на следующие моменты:

1. отступы и пробелы: используйте 4 пробела на один уровень отступа и никогда не смешивайте символы табуляции и пробелы;

2. названия переменных:
используйте говорящие названия для переменных (total, counter, product)
и следуйте стилю lower_case_with_underscores (слова из маленьких букв с подчеркиваниями);

3. пустые строки: дополнительные отступы пустыми строками могут быть изредка полезны для выделения группы логически
связанных частей программы: инициализация переменных, основной алгоритм, завершающая проверка и т.д.;

4. комментарии: комментарии должны являться законченными предложениями.
И помните, комментарии, которые противоречат коду, хуже, чем отсутствие комментариев.
Всегда исправляйте комментарии, если меняете код!